hadlerla/windowsensor/sdkconfig.defaults
# Default configuration for ESP32-C6-WROOM-1 window sensor
CONFIG_IDF_TARGET_ESP32C6=y
CONFIG_IDF_TARGET="esp32c6"

# Application configuration
CONFIG_FREERTOS_HZ=1000

# Window Sensor Configuration for ESP32-C6-WROOM-1
# Use addressable LED strip on GPIO 8 (built-in RGB LED)
CONFIG_BLINK_LED_STRIP=y
CONFIG_BLINK_LED_STRIP_BACKEND_RMT=y
CONFIG_BLINK_GPIO=8
CONFIG_STATUS_LED_GPIO=8
CONFIG_WINDOW_SENSOR_GPIO=4
CONFIG_SENSOR_POLL_PERIOD_MS=1000

# Logging configuration
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Compiler options
CONFIG_COMPILER_OPTIMIZATION_SIZE=y